{
  "table_name": "ABN_NOTE_CONTACT_SERVICE",
  "description": "This extract table contains information for items in the General Use Notes (HNO) ABN Procedures (HNO 2310) related group. These items are populated with information from the Advanced Beneficiary Notice (ABN) waiver form related to the services that triggered an ABN. A row in this table represents one failed service for which an ABN was generated.",
  "primary_key": {
    "column_name": "NOTE_ID",
    "ordinal_position": "1"
  },
  "columns": [
    {
      "index": 2,
      "name": "NOTE_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The unique ID of the note (HNO) record that contains the Advance Beneficiary Notice (ABN) information."
    },
    {
      "index": 7,
      "name": "LINE",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The line number for the information associated with this record. Multiple pieces of information can be associated with this record."
    },
    {
      "index": 12,
      "name": "ABN_PROC_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "This item stores the IDs of procedures that are linked to the ABN."
    },
    {
      "index": 17,
      "name": "ABN_REASON_FOR_NONCOVERAGE",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "This item stores an additional user-specified reason for ABN. The possible reasons based on LCD rules are stored in item 2313 of the ABN record."
    },
    {
      "index": 22,
      "name": "ABN_TRIGGERING_REASON",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Stores the reason for triggering an ABN"
    },
    {
      "index": 27,
      "name": "ABN_PRICE_PER_SERVICE",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "Contains the price per procedure (orderable) or medication for an ABN waiver form. This price will take into account quantity of the procedure ordered."
    },
    {
      "index": 32,
      "name": "ABN_MODIFIER_USED",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "This item holds the modifiers used by price generation code to ensure that we are calculating the price correctly when updating the ABN record."
    },
    {
      "index": 37,
      "name": "ABN_ORIGINAL_PRICE_PER_SERVICE",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "Stores the price generated by the system for a procedure or medication that generated the ABN"
    },
    {
      "index": 42,
      "name": "ABN_MEDICATION_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "Medication IDs linked to the ABN"
    },
    {
      "index": 47,
      "name": "ABN_FAILED_LCD_C",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Indicates which LCD category values the given service failed when run through the blackbox"
    },
    {
      "index": 52,
      "name": "ABN_SERVICE_DUR",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Holds a string displayed in the ABN showing the duration for an ordered procedure or medication."
    }
  ]
}
