{
  "name": "DD_DIA_CMS_START_2",
  "description": "This table contains data elements submitted for CMS ESRD patient registration forms (CMS-2728).",
  "primaryKey": [
    {
      "columnName": "REGISTRY_DATA_ID",
      "ordinalPosition": 1
    }
  ],
  "columns": [
    {
      "ordinalPosition": 1,
      "name": "REGISTRY_DATA_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The unique identifier for the registry data record."
    },
    {
      "ordinalPosition": 2,
      "name": "ALT_PHONE_AREA_CODE",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The area code of the dialysis patient's alternate phone number."
    },
    {
      "ordinalPosition": 3,
      "name": "ALT_PHONE_NUMBER",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The dialysis patient's alternate phone number without the area code."
    },
    {
      "ordinalPosition": 4,
      "name": "AKI_DX_BEFORE_ESRD_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Indicates whether the patient was diagnosed with an acute kidney injury (AKI) in the 12 months prior to starting ESRD therapy. 'Y' indicates the patient was diagnosed with AKI. 'N' indicates the patient was not diagnosed with AKI. 'UNKNOWN' or NULL indicates that it is not known whether the patient was diagnosed with AKI.",
      "entries": [
        "Yes",
        "No",
        "Unknown"
      ]
    },
    {
      "ordinalPosition": 5,
      "name": "AKI_DLYS_TREATMENT_YN",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Indicates whether dialysis was required during the patient's acute kidney injury (AKI). 'Y' indicates that dialysis was required. 'N' or NULL indicates that dialysis was not required.",
      "entries": [
        "No",
        "Yes"
      ]
    },
    {
      "ordinalPosition": 6,
      "name": "PRIOR_HOME_DIALYSIS_OPTIONS_YN",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Indicates whether the patient received and understood options for a home dialysis modality prior to ESRD. 'Y' indicates the patient received and understood options for home dialysis. 'N' or NULL indicates the patient did not receive or did not understand options for home dialysis."
    },
    {
      "ordinalPosition": 7,
      "name": "PRIOR_TRANSPLANT_OPTIONS_YN",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Indicates whether the patient received and understood options for a kidney transplant prior to ESRD. 'Y' indicates the patient received and understood options for transplant. 'N' or NULL indicates the patient did not receive or did not understand options for transplant."
    },
    {
      "ordinalPosition": 8,
      "name": "LIVE_TRANSPLANT_EVALUATED_YN",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Indicates whether the patient received options for a living donor kidney transplant prior to ESRD. 'Y' indicates the patient received and understood options for a living donor kidney transplant. 'N' or NULL indicates the patient did not receive or did not understand options for a living donor kidney transplant."
    },
    {
      "ordinalPosition": 9,
      "name": "PRIOR_MED_MANAGEMENT_OPTION_YN",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Indicates whether the patient received and understood options for active medical management without dialysis prior to ESRD. 'Y' indicates the patient received and understood options for not starting dialysis. 'N' or NULL indicates the patient did not receive or did not understand options for not starting dialysis."
    },
    {
      "ordinalPosition": 10,
      "name": "ADMISSION_TRANSPLANT_OPTION_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Indicates whether the patient understood options for a kidney transplant at the time of admission for chronic dialysis treatment. 'Y' indicates the patient understood options for a kidney transplant. 'N' or NULL indicates the patient did not understand options for a kidney transplant. 'N/A' indicates that the patient received and understood options for a kidney transplant prior to admission.",
      "entries": [
        "No (Old)",
        "Yes (Old)",
        "N/A (Old)",
        "Yes",
        "No",
        "N/A"
      ]
    },
    {
      "ordinalPosition": 11,
      "name": "ADMISSION_TRANSPLANT_RFL_YN",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Indicates whether a patient was referred to a transplant center at the time of admission for chronic dialysis treatment. 'Y' indicates the patient was referred to a transplant center. 'N' or NULL indicates the patient did not receive a referral."
    },
    {
      "ordinalPosition": 12,
      "name": "ADMISSION_TRANSPLANT_RFL_DATE",
      "type": "DATETIME",
      "discontinued": false,
      "description": "The date entered on CMS Form 2728 when the dialysis patient was referred to a transplant center."
    },
    {
      "ordinalPosition": 13,
      "name": "ADMISSION_TRANSPLANT_RFL_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The name of the transplant center where the dialysis patient was referred."
    },
    {
      "ordinalPosition": 14,
      "name": "ADMIT_HOME_DIALYSIS_OPTIONS_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Indicates whether the patient understood options for home dialysis modalities at the time of admission for chronic dialysis treatment. 'Y' indicates the patient understood options for home dialysis modalities. 'N' or NULL indicates the patient did not understand options for home dialysis modalities. 'N/A' indicates that the patient received and understood options for home dialysis modalities prior to admission."
    },
    {
      "ordinalPosition": 15,
      "name": "PAT_HAS_LIVING_WILL_YN",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Indicates whether the patient has a living will or medical/physician order on file. 'Y' indicates the patient has a living will or a medical/physician order on file. 'N' or NULL indicates the patient does not have a living will or medical/physician order on file, or it is unknown whether the patient has a living will or medical/physician order on file."
    },
    {
      "ordinalPosition": 16,
      "name": "PAT_HAS_SHELTER_CNCRN_YN",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Indicates whether the patient is concerned about where they will live over the next 90 days. 'Y' indicates the patient is concerned about where they will live over the next 90 days. 'N' or NULL indicates the patient is not concerned about where they will live over the next 90 days, or it is unknown whether the patient is concerned about where they will live over the next 90 days."
    },
    {
      "ordinalPosition": 17,
      "name": "CARE_GIVER_SUPP_DAILY_CARE_YN",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Indicates whether the patient has caregiver support for daily care. 'Y' indicates the patient has caregiver support for their daily care. 'N' or NULL indicates the patient does not have caregiver support for their daily care, or it is unknown whether the patient has caregiver support for their daily care."
    },
    {
      "ordinalPosition": 18,
      "name": "CARE_GIVER_SUPP_DIALYSIS_YN",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Indicates whether the patient has caregiver support for home dialysis or kidney transplant. 'Y' indicates the patient has caregiver support for home dialysis or kidney transplant. 'N' or NULL indicates the patient does not have caregiver support for home dialysis or kidney transplant, or it is unknown whether the patient has caregiver support for home dialysis or kidney transplant."
    },
    {
      "ordinalPosition": 19,
      "name": "CARE_GIVER_LIVE_WITH_PAT_YN",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Indicates whether the patient's caregiver lives with them. 'Y' indicates the patient 's caregiver lives with them. 'N' or NULL indicates the patient's caregiver does not live with them, or it is unknown whether the patient's caregiver lives with them."
    },
    {
      "ordinalPosition": 20,
      "name": "PAT_RELIABLE_TXPORT_YN",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Indicates whether the patient has access to reliable transportation. 'Y' indicates the patient has access to reliable transportation. 'N' or NULL indicates the patient does not have access to reliable transportation, or it is unknown whether the patient has access to reliable transportation."
    },
    {
      "ordinalPosition": 21,
      "name": "PAT_UNDERSTAND_LIT_ENGLISH_YN",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Indicates whether the patient understands health literature in English. 'Y' indicates the patient understands health literature in English. 'N' or NULL indicates the patient does not understand health literature in English, or it is unknown whether the patient understands health literature in English."
    },
    {
      "ordinalPosition": 22,
      "name": "PAT_NEED_ALT_EDUCATION_YN",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Indicates whether the patient needs a different way other than written documents to learn about their health. 'Y' indicates the patient needs a different way other than written documents to learn about their health. 'N' or NULL indicates the patient does not need a different way other than written documents to learn about their health, or it is unknown whether the patient needs a different way other than written documents to learn about their health."
    },
    {
      "ordinalPosition": 23,
      "name": "PAT_NEED_TRANSLATOR_YN",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Indicates whether the patient needs a translator to understand health information. 'Y' indicates the patient needs a translator. 'N' or NULL indicates the patient does not need a translator, or it is unknown whether the patient needs a translator."
    },
    {
      "ordinalPosition": 24,
      "name": "PAT_FIN_INSECURE_YN",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Indicates whether the patient finds it hard to pay for the very basics like housing, medical care, electricity, and heating. 'Y' indicates the patient is experiencing financial insecurity. 'N' or NULL indicates the patient is not experiencing financial insecurity, or it is unknown whether the patient is experiencing financial insecurity."
    },
    {
      "ordinalPosition": 25,
      "name": "PAT_FOOD_INSECURE_YN",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Indicates whether within the past 12 months, the food the patient bought did not last and the patient didn't have money to get more. 'Y' indicates the patient is experiencing food insecurity. 'N' or NULL indicates the patient is not experiencing food insecurity, or it is unknown whether the patient is experiencing food insecurity."
    },
    {
      "ordinalPosition": 26,
      "name": "PAT_RISK_OF_VIOLENCE_YN",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Indicates whether anyone, including the patient's family and friends, threatened the patient with harm or physically hurt them in the last 12 months. 'Y' indicates the patient is at risk of experiencing harm. 'N' or NULL indicates the patient is not at risk of experiencing harm, or it is unknown whether the patient is at risk of experiencing harm."
    }
  ]
}
