{
  "name": "HH_COVERAGE_CHANGE_HX",
  "description": "This table contains audit information about a patient's coverage change.",
  "primaryKey": [
    {
      "columnName": "SUMMARY_BLOCK_ID",
      "ordinalPosition": 1
    },
    {
      "columnName": "LINE",
      "ordinalPosition": 2
    }
  ],
  "columns": [
    {
      "ordinalPosition": 1,
      "name": "SUMMARY_BLOCK_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The unique identifier for the episode record."
    },
    {
      "ordinalPosition": 2,
      "name": "LINE",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The line number for the information associated with this record. Multiple pieces of information can be associated with this record."
    },
    {
      "ordinalPosition": 3,
      "name": "HH_COVERAGE_CHANGE_DATE",
      "type": "DATETIME",
      "discontinued": false,
      "description": "Auditing history of the date a coverage change was indicated on a patient's Home Health episode."
    },
    {
      "ordinalPosition": 4,
      "name": "HH_COVCHG_REASON_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Auditing history of the reason a coverage change was indicated on a patient's Home Health episode.",
      "entries": [
        "Information updated",
        "Coverage change completed"
      ]
    },
    {
      "ordinalPosition": 5,
      "name": "EDIT_USER_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Auditing history of the ID of the user who edited the coverage change indication."
    },
    {
      "ordinalPosition": 6,
      "name": "EDIT_UTC_DTTM",
      "type": "DATETIME (UTC) ",
      "discontinued": false,
      "description": "Auditing history of the instant at which edits were made to the coverage change indication."
    },
    {
      "ordinalPosition": 7,
      "name": "PAT_STATUS_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Auditing history of the discharge disposition recorded for a truncated hospital account following a coverage change.",
      "entries": [
        "Discharged/transferred to Court/Law Enforcement",
        "Still a Patient",
        "Expired at Home",
        "Expired in a Medical Facility (e.g. hospital, SNF, ICF, or free standing hospice)",
        "Expired - Place Unknown",
        "Discharged/transferred to a Federal Health Care Facility",
        "Hospice - Home",
        "Hospice - Medical Facility (Certified) Providing Hospice Level of Care",
        "Discharged/transferred to a Hospital-Based Medicare Approved Swing Bed",
        "Discharged/transferred to an Inpatient Rehab Facility (IRF)",
        "Discharged/transferred to a Medicare Certified Long Term Care Hospital (LTCH)",
        "Discharged/transferred to a Nursing Fac Certified under Medicaid but not Medicare",
        "Discharged/transferred to a Psychiatric Hospital or Psychiatric Hospital Unit",
        "Discharged/transferred to a Critical Access Hospital (CAH)",
        "Disch/trans to Another Type of Health Care Inst not Defined Elsewhere in this List",
        "Disch/transfer/referral to another inst for outpat services (discontinued 4/1/2003)",
        "Disch/transfer/referral to this inst for outpatient services (discontinued 4/1/2003)",
        "Discharged to Home or Self Care (Routine Discharge)",
        "Discharged/transferred to a Short-Term General Hospital for Inpatient Care",
        "Discharged/transferred to Skilled Nursing Facility (SNF) with Medicare Certification",
        "Discharged/transferred to a Facility that Provides Custodial or Supportive Care",
        "Discharged/transferred to a Designated Cancer Center or Children's Hospital",
        "Discharged/transferred to Home Under Care of Organized Home Health Service Org",
        "Left Against Medical Advice or Discontinued Care",
        "Discharged/transferred to home under care of home IV therapy provider (disc 10/1/05)",
        "Admitted as an Inpatient to this Hospital"
      ]
    },
    {
      "ordinalPosition": 8,
      "name": "PRIM_CVG",
      "type": "INTEGER",
      "discontinued": false,
      "description": "Auditing history of the primary coverage for a Home Health episode before a coverage change."
    }
  ]
}
