{
  "name": "HSP_ACCT_CLAIM_HAR",
  "description": "This table contains hospital account claims information extracted from hospital account records.",
  "primaryKey": [
    {
      "columnName": "ACCT_ID",
      "ordinalPosition": 1
    }
  ],
  "columns": [
    {
      "ordinalPosition": 1,
      "name": "ACCT_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "This column stores the unique identifier for the hospital account."
    },
    {
      "ordinalPosition": 2,
      "name": "UB92_COVEREDDAYS",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This column stores the UB92 Covered days (inpatient only): the number of days covered by the primary payer, as qualified by the payer organization."
    },
    {
      "ordinalPosition": 3,
      "name": "UB92_NONCOVEREDDAY",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This column stores the UB92 Non Covered days (inpatient only): the number of days not covered by the primary payer, as qualified by the payer organization."
    },
    {
      "ordinalPosition": 4,
      "name": "UB92_COINSDAYS",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This column stores the UB92 Coinsurance days: Days covered by secondary coverage in addition to primary coverage."
    },
    {
      "ordinalPosition": 5,
      "name": "UB92_RESERVEDAYS",
      "type": "INTEGER",
      "discontinued": false,
      "description": "UB92 Lifetime Reserve Days (INPATIENT ONLY):  Each beneficiary has a lifetime reserve of 60 additional days after using 90 days of inpatient hospital services during a spell of illness.  Lifetime reserve days are not renewable."
    },
    {
      "ordinalPosition": 6,
      "name": "ADMISSION_TYPE_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The admission type category ID for the hospital account.",
      "entries": [
        "Urgent",
        "Elective",
        "Newborn",
        "Trauma Center",
        "Information Not Available",
        "Inpatient",
        "Outpatient",
        "Pre-Operative",
        "Post-Operative"
      ]
    },
    {
      "ordinalPosition": 7,
      "name": "ADMISSION_SOURCE_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The admission source (e.g., Physician Referral, Transfer from a Hospital, Information Not Available) for the patient encounter associated with this hospital account.",
      "entries": [
        "Clinic or Physician's Office",
        "HMO Referral",
        "Transfer from a Hospital (Different Facility)",
        "Transfer from Skilled Nursing (SNF), Intermediate Care (ICF) or Assisted Living (ALF)",
        "Transfer from Another Health Care Facility",
        "Emergency Room",
        "Court/Law Enforcement",
        "Information Not Available",
        "Transfer from Psych, Substance Abuse, or Rehab Hospital",
        "Normal Delivery",
        "Premature Delivery",
        "Sick Baby",
        "Extramural Birth",
        "Transfer from Another Home Health Agency",
        "Readmission to Same Home Health Agency",
        "Transfer from Critical Access Hospital",
        "Transfer from One Distinct Unit to another Distinct Unit in Same Hospital",
        "Transfer from Critical Access Hospital",
        "Transfer from another Home Health Agency",
        "Readmission to same Home Health Agency",
        "Transfer from Ambulatory Surgery Center",
        "Transfer from a Hospice Facility",
        "Born Inside this Hospital",
        "Born Outside of this Hospital"
      ]
    },
    {
      "ordinalPosition": 8,
      "name": "UB92_TOB_OVERRIDE",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "This column stores the Type of Bill (TOB) override: TOB is a numeric code printed on claims that provide encounter information to a payer. Values entered here will override system settings that normally determine the TOB."
    },
    {
      "ordinalPosition": 9,
      "name": "AUTHORIZATION_NUM",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Authorization Number: Used on claims for identifying patient referrals and affected reimbursements."
    },
    {
      "ordinalPosition": 10,
      "name": "PARTA_EXHAUST_DT",
      "type": "DATETIME",
      "discontinued": false,
      "description": "The date on which the patient's Part A benefits are exhausted for this inpatient stay.  Part A benefits cover up to 90 inpatient days per stay (plus any lifetime reserve days the patient may opt to use after the 90th day).  After these days have been used, Part A claims will be denied.  Inpatient Part B claims may be submitted for appropriate services."
    },
    {
      "ordinalPosition": 11,
      "name": "PATIENT_STATUS_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The patient status for the patient associated with this hospital account (e.g., Alive, Dead, Unknown, Discharged to Home or Self Care, Admitted as an Inpatient to this Hospital).",
      "entries": [
        "Discharged/transferred to Court/Law Enforcement",
        "Still a Patient",
        "Expired at Home",
        "Expired in a Medical Facility (e.g. hospital, SNF, ICF, or free standing hospice)",
        "Expired - Place Unknown",
        "Discharged/transferred to a Federal Health Care Facility",
        "Hospice - Home",
        "Hospice - Medical Facility (Certified) Providing Hospice Level of Care",
        "Discharged/transferred to a Hospital-Based Medicare Approved Swing Bed",
        "Discharged/transferred to an Inpatient Rehab Facility (IRF)",
        "Discharged/transferred to a Medicare Certified Long Term Care Hospital (LTCH)",
        "Discharged/transferred to a Nursing Fac Certified under Medicaid but not Medicare",
        "Discharged/transferred to a Psychiatric Hospital or Psychiatric Hospital Unit",
        "Discharged/transferred to a Critical Access Hospital (CAH)",
        "Disch/trans to Another Type of Health Care Inst not Defined Elsewhere in this List",
        "Disch/transfer/referral to another inst for outpat services (discontinued 4/1/2003)",
        "Disch/transfer/referral to this inst for outpatient services (discontinued 4/1/2003)",
        "Discharged to Home or Self Care (Routine Discharge)",
        "Discharged/transferred to a Short-Term General Hospital for Inpatient Care",
        "Discharged/transferred to Skilled Nursing Facility (SNF) with Medicare Certification",
        "Discharged/transferred to a Facility that Provides Custodial or Supportive Care",
        "Discharged/transferred to a Designated Cancer Center or Children's Hospital",
        "Discharged/transferred to Home Under Care of Organized Home Health Service Org",
        "Left Against Medical Advice or Discontinued Care",
        "Discharged/transferred to home under care of home IV therapy provider (disc 10/1/05)",
        "Admitted as an Inpatient to this Hospital"
      ]
    },
    {
      "ordinalPosition": 12,
      "name": "SHAREABLE_CLAIM_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "This column stores the unique identifier for a shareable claim associated with the hospital account."
    },
    {
      "ordinalPosition": 13,
      "name": "NONCVRD_SNF_STAY_YN",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "This item indicates whether the Skilled Nursing Facility (SNF) stay billed on this account is non-covered due to not having a prior qualifying inpatient stay.",
      "entries": [
        "No",
        "Yes"
      ]
    }
  ]
}
