{
  "table_name": "IRFPAI_MOTOR_INFO",
  "description": "This table stores the values documented in the IRF-PAI for all the Section GG (Care Tool) admission and discharge items, and Section H items documenting bowel and bladder incontinence.",
  "primary_key": {
    "column_name": "REGISTRY_DATA_ID",
    "ordinal_position": "1"
  },
  "columns": [
    {
      "index": 2,
      "name": "REGISTRY_DATA_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The unique identifier of the abstraction for this row."
    },
    {
      "index": 7,
      "name": "EATING_ADMSN_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element measures the ability to use suitable utensils to bring food to the mouth and swallow food once the meal is presented on a table/tray (includes modified food consistency) at admission."
    },
    {
      "index": 12,
      "name": "EATING_GOAL_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element indicates the discharge goal of the ability to use suitable utensils to bring food to the mouth and swallow food once the meal is presented on a table/tray (includes modified food consistency)."
    },
    {
      "index": 17,
      "name": "EATING_DISCH_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element measures the ability to use suitable utensils to bring food to the mouth and swallow food once the meal is presented on a table/tray (includes modified food consistency) at discharge."
    },
    {
      "index": 22,
      "name": "ORAL_HYGIENE_ADMSN_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element measures the ability to use suitable items to clean teeth, or the ability to remove and replace dentures, if applicable, from and to the mouth, and manage equipment for soaking and rinsing them at admission."
    },
    {
      "index": 27,
      "name": "ORAL_HYGIENE_GOAL_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element indicates the discharge goal of the ability to use suitable items to clean teeth, or the ability to remove and replace dentures, if applicable, from and to the mouth, and manage equipment for soaking and rinsing them."
    },
    {
      "index": 32,
      "name": "ORAL_HYGIENE_DISCH_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element measures the ability to use suitable items to clean teeth, or the ability to remove and replace dentures, if applicable, from and to the mouth, and manage equipment for soaking and rinsing them at discharge."
    },
    {
      "index": 37,
      "name": "TOILET_HYGIENE_ADMSN_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element measures the ability to maintain perineal hygiene, adjust clothes before and after using the toilet, commode, bedpan or urinal, and, if managing an ostomy, includes wiping the opening but not managing equipment at admission."
    },
    {
      "index": 42,
      "name": "TOILET_HYGIENE_GOAL_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element indicates the discharge goal of the ability to maintain perineal hygiene, adjust clothes before and after using the toilet, commode, bedpan or urinal, and, if managing an ostomy, includes wiping the opening but not managing equipment."
    },
    {
      "index": 47,
      "name": "TOILET_HYGIENE_DISCH_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element measures the ability to maintain perineal hygiene, adjust clothes before and after using the toilet, commode, bedpan or urinal, and, if managing an ostomy, includes wiping the opening but not managing equipment at discharge."
    },
    {
      "index": 52,
      "name": "SHOWERBATHE_SELF_ADMSN_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element measures the ability to bathe self in shower or tub, including washing, rinsing, and drying self, but does not include transferring in/out of tub/shower at admission."
    },
    {
      "index": 57,
      "name": "SHOWERBATHE_SELF_GOAL_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element indicates the discharge goal of the ability to bathe self in shower or tub, including washing, rinsing, and drying self, but does not include transferring in/out of tub/shower."
    },
    {
      "index": 62,
      "name": "SHOWERBATHE_SELF_DISCH_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element measures the ability to bathe self in shower or tub, including washing, rinsing, and drying self, but does not include transferring in/out of tub/shower at discharge."
    },
    {
      "index": 67,
      "name": "UPPER_BODY_DRESSING_ADMSN_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element measures the ability to put on and remove shirt or pajama top and includes buttoning, if applicable, at admission."
    },
    {
      "index": 72,
      "name": "UPPER_BODY_DRESSING_GOAL_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element indicates the discharge goal of the ability to put on and remove shirt or pajama top and includes buttoning, if applicable."
    },
    {
      "index": 77,
      "name": "UPPER_BODY_DRESSING_DISCH_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element measures the ability to put on and remove shirt or pajama top and includes buttoning, if applicable, at discharge."
    },
    {
      "index": 82,
      "name": "LOWER_BODY_DRESSING_ADMSN_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element measures the ability to dress and undress below the waist, including fasteners but does not include footwear at admission."
    },
    {
      "index": 87,
      "name": "LOWER_BODY_DRESSING_GOAL_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element indicates the discharge goal of the ability to dress and undress below the waist, including fasteners but does not include footwear."
    },
    {
      "index": 92,
      "name": "LOWER_BODY_DRESSING_DISCH_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element measures the ability to dress and undress below the waist, including fasteners but does not include footwear at discharge."
    },
    {
      "index": 97,
      "name": "PUTTING_FOOTWEAR_ONOFF_ADMSN_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element measures the ability to put on and take off socks and shoes or other footwear that is appropriate for safe mobility at admission."
    },
    {
      "index": 102,
      "name": "PUTTING_FOOTWEAR_ONOFF_GOAL_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element indicates the discharge goal of the ability to put on and take off socks and shoes or other footwear that is appropriate for safe mobility."
    },
    {
      "index": 107,
      "name": "PUTTING_FOOTWEAR_ONOFF_DISCH_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element measures the ability to put on and take off socks and shoes or other footwear that is appropriate for safe mobility at discharge."
    },
    {
      "index": 112,
      "name": "ROLL_LEFT_AND_RIGHT_ADMSN_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element measures the ability to roll from lying on back to the left and right side, and then return to lying on back at admission."
    },
    {
      "index": 117,
      "name": "ROLL_LEFT_AND_RIGHT_GOAL_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element indicates the discharge goal of the ability to roll from lying on back to the left and right side, and then return to lying on back."
    },
    {
      "index": 122,
      "name": "ROLL_LEFT_AND_RIGHT_DISCH_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element measures the ability to roll from lying on back to the left and right side, and then return to lying on back at discharge."
    },
    {
      "index": 127,
      "name": "SIT_TO_LYING_ADMSN_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element measures the ability to move from sitting on the side of bed to lying flat on the bed at admission."
    },
    {
      "index": 132,
      "name": "SIT_TO_LYING_GOAL_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element indicates the discharge goal of the ability to move from sitting on the side of bed to lying flat on the bed."
    },
    {
      "index": 137,
      "name": "SIT_TO_LYING_DISCH_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element measures the ability to move from sitting on the side of bed to lying flat on the bed at discharge."
    },
    {
      "index": 142,
      "name": "LYING_TO_SITTING_ADMSN_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element measures the ability to safely move from lying on the back to sitting on the side of the bed with feet flat on the floor, and with no back support, at admission."
    },
    {
      "index": 147,
      "name": "LYING_TO_SITTING_GOAL_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element indicates the discharge goal of the ability to safely move from lying on the back to sitting on the side of the bed with feet flat on the floor, and with no back support."
    },
    {
      "index": 152,
      "name": "LYING_TO_SITTING_DISCH_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element measures the ability to safely move from lying on the back to sitting on the side of the bed with feet flat on the floor, and with no back support, at discharge."
    },
    {
      "index": 157,
      "name": "SIT_TO_STAND_ADMSN_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element measures the ability to safely come to a standing position from sitting in a chair or on the side of the bed at admission."
    },
    {
      "index": 162,
      "name": "SIT_TO_STAND_GOAL_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element indicates the discharge goal of the ability to safely come to a standing position from sitting in a chair or on the side of the bed."
    },
    {
      "index": 167,
      "name": "SIT_TO_STAND_DISCH_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element measures the ability to safely come to a standing position from sitting in a chair or on the side of the bed at discharge."
    },
    {
      "index": 172,
      "name": "CHAIRBEDTOCHAIR_TRANS_ADMSN_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element measures the ability to safely transfer to and from a bed to a chair (or wheelchair) at admission."
    },
    {
      "index": 177,
      "name": "CHAIRBEDTOCHAIR_TRANS_GOAL_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element indicates the discharge goal of the ability to safely transfer to and from a bed to a chair (or wheelchair)."
    },
    {
      "index": 182,
      "name": "CHAIRBEDTOCHAIR_TRANS_DISCH_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element measures the ability to safely transfer to and from a bed to a chair (or wheelchair) at discharge."
    },
    {
      "index": 187,
      "name": "TOILET_TRANS_ADMSN_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element measures the ability to safely get on and off a toilet or commode at admission."
    },
    {
      "index": 192,
      "name": "TOILET_TRANS_GOAL_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element indicates the discharge goal of the ability to safely get on and off a toilet or commode."
    },
    {
      "index": 197,
      "name": "TOILET_TRANS_DISCH_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element measures the ability to safely get on and off a toilet or commode at discharge."
    },
    {
      "index": 202,
      "name": "CAR_TRANS_ADMSN_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element measures the ability to transfer in and out of a car or van on the passenger side and does not include the ability to open/close door or fasten seat belt at admission."
    },
    {
      "index": 207,
      "name": "CAR_TRANS_GOAL_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element indicates the discharge goal of the ability to transfer in and out of a car or van on the passenger side and does not include the ability to open/close door or fasten seat belt."
    },
    {
      "index": 212,
      "name": "CAR_TRANS_DISCH_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element measures the ability to transfer in and out of a car or van on the passenger side and does not include the ability to open/close door or fasten seat belt at discharge."
    },
    {
      "index": 217,
      "name": "WALK_10_FEET_ADMSN_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element measures the ability to, once standing, walk at least 10 feet in a corridor or similar space at admission."
    },
    {
      "index": 222,
      "name": "WALK_10_FEET_GOAL_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element indicates the discharge goal of the ability to, once standing, walk at least 10 feet in a corridor or similar space."
    },
    {
      "index": 227,
      "name": "WALK_10_FEET_DISCH_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element measures the ability to, once standing, walk at least 10 feet in a corridor or similar space at discharge."
    },
    {
      "index": 232,
      "name": "WALK_50_FT_2TURNS_ADMSN_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element measures the ability to, once standing, walk at least 50 feet and make two turns at admission."
    },
    {
      "index": 237,
      "name": "WALK_50_FT_2TURNS_GOAL_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element indicates the discharge goal of the ability to, once standing, walk at least 50 feet and make two turns."
    },
    {
      "index": 242,
      "name": "WALK_50_FT_2TURNS_DISCH_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element measures the ability to, once standing, walk at least 50 feet and make two turns at discharge."
    },
    {
      "index": 247,
      "name": "WALK_150_FT_ADMSN_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element measures the ability to, once standing, walk at least 150 feet in a corridor or similar space at admission."
    },
    {
      "index": 252,
      "name": "WALK_150_FT_GOAL_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element indicates the discharge goal of the ability to, once standing, walk at least 150 feet in a corridor or similar space."
    },
    {
      "index": 257,
      "name": "WALK_150_FT_DISCH_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element measures the ability to, once standing, walk at least 150 feet in a corridor or similar space at discharge."
    },
    {
      "index": 262,
      "name": "WALK_10_FT_UNEVEN_SURF_ADMSN_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element measures the ability to walk 10 feet on uneven or sloping surfaces, such as grass or gravel, at admission."
    },
    {
      "index": 267,
      "name": "WALK_10_FT_UNEVEN_SURF_GOAL_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element indicates the discharge goal of the ability to walk 10 feet on uneven or sloping surfaces, such as grass or gravel."
    },
    {
      "index": 272,
      "name": "WALK_10_FT_UNEVEN_SURF_DISCH_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element measures the ability to walk 10 feet on uneven or sloping surfaces, such as grass or gravel, at discharge."
    },
    {
      "index": 277,
      "name": "ONE_STEP_CURB_ADMSN_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element measures the ability to step over a curb or up and down one step at admission."
    },
    {
      "index": 282,
      "name": "ONE_STEP_CURB_GOAL_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element indicates the discharge goal of the ability to step over a curb or up and down one step."
    },
    {
      "index": 287,
      "name": "ONE_STEP_CURB_DISCH_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element measures the ability to step over a curb or up and down one step at discharge."
    },
    {
      "index": 292,
      "name": "FOUR_STEPS_ADMSN_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element measures the ability to go up and down four steps with or without a rail at admission."
    },
    {
      "index": 297,
      "name": "FOUR_STEPS_GOAL_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element indicates the discharge goal of the ability to go up and down four steps with or without a rail."
    },
    {
      "index": 302,
      "name": "FOUR_STEPS_DISCH_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element measures the ability to go up and down four steps with or without a rail at discharge."
    },
    {
      "index": 307,
      "name": "TWELVE_STEPS_ADMSN_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element measures the ability to go up and down 12 steps with or without a rail at admission."
    },
    {
      "index": 312,
      "name": "TWELVE_STEPS_GOAL_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element indicates the discharge goal of the ability to go up and down 12 steps with or without a rail."
    },
    {
      "index": 317,
      "name": "TWELVE_STEPS_DISCH_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element measures the ability to go up and down 12 steps with or without a rail at discharge."
    },
    {
      "index": 322,
      "name": "PICK_UP_OBJECT_ADMSN_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element measures the ability to bend/stoop from a standing position to pick up a small object, such as a spoon, from the floor at admission."
    },
    {
      "index": 327,
      "name": "PICK_UP_OBJECT_GOAL_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element indicates the discharge goal of the ability to bend/stoop from a standing position to pick up a small object, such as a spoon, from the floor."
    },
    {
      "index": 332,
      "name": "PICK_UP_OBJECT_DISCH_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element measures the ability to bend/stoop from a standing position to pick up a small object, such as a spoon, from the floor at discharge."
    },
    {
      "index": 337,
      "name": "USES_WHEELCHAIR_SCOOTR_ADMSN_C",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Indicates if the resident uses a wheelchair/scooter at admission."
    },
    {
      "index": 342,
      "name": "USES_WHEELCHAIR_SCOOTR_DISCH_C",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Indicates if the resident uses a wheelchair/scooter at discharge."
    },
    {
      "index": 347,
      "name": "WHEEL_50_FT_2TURNS_ADMSN_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element measures the ability to, once seated in wheelchair/scooter, wheel at least 50 feet and make two turns at admission."
    },
    {
      "index": 352,
      "name": "WHEEL_50_FT_2TURNS_GOAL_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element indicates the discharge goal of the ability to, once seated in wheelchair/scooter, wheel at least 50 feet and make two turns."
    },
    {
      "index": 357,
      "name": "WHEEL_50_FT_2TURNS_DISCH_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element measures the ability to, once seated in wheelchair/scooter, wheel at least 50 feet and make two turns at discharge."
    },
    {
      "index": 362,
      "name": "WHEEL_50_FT_2TURNS_TYP_ADMSN_C",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Indicates the type of wheelchair/scooter used to wheel 50 feet with two turns at admission."
    },
    {
      "index": 367,
      "name": "WHEEL_50_FT_2TURNS_TYP_DISCH_C",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Indicates the type of wheelchair/scooter used to wheel 50 feet with two turns at discharge."
    },
    {
      "index": 372,
      "name": "WHEEL_150_FT_ADMSN_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element measures the ability to, once seated in wheelchair/scooter, wheel at least 150 feet in a corridor or similar space at admission."
    },
    {
      "index": 377,
      "name": "WHEEL_150_FT_GOAL_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element indicates the discharge goal of the ability to, once seated in wheelchair/scooter, wheel at least 150 feet in a corridor or similar space."
    },
    {
      "index": 382,
      "name": "WHEEL_150_FT_DISCH_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This element measures the ability to, once seated in wheelchair/scooter, wheel at least 150 feet in a corridor or similar space at discharge."
    },
    {
      "index": 387,
      "name": "WHEEL_150_FT_TYP_ADMSN_C",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Indicates the type of wheelchair/scooter used to wheel 150 feet at admission."
    },
    {
      "index": 392,
      "name": "WHEEL_150_FT_TYP_DISCH_C",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Indicates the type of wheelchair/scooter used to wheel 150 feet at discharge."
    },
    {
      "index": 397,
      "name": "BLADDER_CONTINENCE_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "Indicates level of bladder continence at admission."
    },
    {
      "index": 402,
      "name": "BOWEL_CONTINENCE_C",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Indicates level of bowel continence at admission."
    },
    {
      "index": 407,
      "name": "MOTOR_SCORE",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The total motor score for a patient based on mobility and self care assessments."
    }
  ]
}
