{
  "name": "OR_LOG_VIRTUAL",
  "description": "The OR_LOG_VIRTUAL table contains virtual items for the OR management system log records.",
  "primaryKey": [
    {
      "columnName": "LOG_ID",
      "ordinalPosition": 1
    }
  ],
  "columns": [
    {
      "ordinalPosition": 1,
      "name": "LOG_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The unique identifier (.1 item) for the log record."
    },
    {
      "ordinalPosition": 2,
      "name": "RESP_ANES_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The unique ID of the responsible anesthesia provider for the log. The logic first looks to what is documented in Anesthesia and then if nothing is documented, it uses what is documented in OpTime.   For Anesthesia, the responsible anesthesia provider is based on the mode specified in the System Definitions (LSD 1) item 89400. The three options being the provider responsible for the most amount of time, the first responsible, or the last responsible. The staff types considered to be an anesthesia provider are specified in the profile (LPR) settings. For OpTime, the logic to determine who is responsible is based on the first anesthesia provider documented in the room. If no anesthesia provider has a time associated, then the first one listed on the log is used. The staff types associated with an anesthesia provider are specified in the Systems Definitions (EAF 1)."
    },
    {
      "ordinalPosition": 3,
      "name": "CASE_LEN_MIN_DIFF",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This column holds the absolute difference between the scheduled minutes in room and actual minutes in room of the case."
    },
    {
      "ordinalPosition": 4,
      "name": "CASE_LEN_PCT_DIFF",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This column holds percent difference between the scheduled minutes in room and actual minutes in room of the case. The percent is determined by taking the absolute difference between scheduled minutes in room and actual minutes in room and dividing by the actual minutes in room."
    },
    {
      "ordinalPosition": 5,
      "name": "CASE_LEN_OVER_UND_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "This column holds the category value for whether the case is overscheduled or underscheduled. This column will be blank if case length accuracy cannot be determined or if the case has no deviation.",
      "entries": [
        "Accurate",
        "Overscheduled",
        "Underscheduled"
      ]
    },
    {
      "ordinalPosition": 6,
      "name": "CASE_LEN_ACCURAT_YN",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "This column indicates whether the case was accurately scheduled according to the threshold defined in the System or Location Definitions. Y indicates that the case is considered to have an accurate scheduled case length. N indicates that the case is not considered to have an accurate scheduled case length. A null value indicates that an event needed for the calculation was missing and case length accuracy cannot be determined.",
      "entries": [
        "No",
        "Yes"
      ]
    },
    {
      "ordinalPosition": 7,
      "name": "CASE_LEN_MIN_THRESH",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This column holds the threshold in minutes used to determine case length accuracy."
    },
    {
      "ordinalPosition": 8,
      "name": "CASE_CLASS_COMPLIANT_YN",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Stores whether a case is compliant to the threshold associated with its case classification. Y means the difference between the case request time and in room time is less than the associated threshold for this case. N means the difference between the case request time and in room time is greater than the associated threshold for this case. Null means that compliance could not be determined."
    },
    {
      "ordinalPosition": 9,
      "name": "CASE_CLASS_THRESHOLD",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The threshold in minutes associated with the case classification for this case."
    },
    {
      "ordinalPosition": 10,
      "name": "INCLUDE_ORG_VOLUME_REPORT_YN",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "This column indicates whether the case is included in organizational volume reporting based on room, service, holiday, weekend, and procedure not performed exclusions defined in System or Location Definitions. Y indicates that the case is included in volume reporting. N indicates that the case is not included in volume reporting."
    },
    {
      "ordinalPosition": 11,
      "name": "INCLUDE_ORG_CLA_REPORT_YN",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "This column indicates whether the case is included in organizational case length accuracy reporting based on room, service, holiday, weekend, and add-on exclusions defined in System or Location Definitions. Y indicates that the case is included in case length accuracy reporting. N indicates that the case is not included in case length accuracy reporting."
    },
    {
      "ordinalPosition": 12,
      "name": "LOG_EXCLUSION_REASON_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "This item contains the reason a log should be excluded from regulatory reporting and registry inclusion. This item is set based on the I ORD 895 value of the log's active procedure orders. If all active linked procedure orders have an active value in I ORD 895, this item will be set to Documented on Wrong Patient [2] if all the orders are set to that value, otherwise this item will be set to Unsuccessful Attempt [1] if all the orders are set to that value or if there is a mix of values 1 and 2. If any active linked procedure orders on the log do not have an active flag in I ORD 895, this item will be null.",
      "entries": [
        "Unsuccessful Attempt",
        "Documented on Wrong Patient"
      ]
    }
  ]
}
