{
  "table_name": "ORDER_DX_MED",
  "description": "The ORDER_DX_MED table enables you to report on the diagnoses associated with medications ordered in clinical system (prescriptions). Since one medication order may be associated with multiple diagnoses, each row in this table is one medication - diagnosis relation. We have also included patient and contact identification information for each record. Note that system settings may or may not require that medications be associated with diagnoses.  This table contains only information for those medications and diagnoses that have been explicitly associated.  Check with your clinical system Application Administrator to determine how your organization has this set up.",
  "primary_key": {
    "column_name": "ORDER_MED_ID",
    "ordinal_position": "1"
  },
  "columns": [
    {
      "index": 2,
      "name": "ORDER_MED_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The unique ID of the medication order (prescription) record."
    },
    {
      "index": 7,
      "name": "LINE",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The line number for the information associated with this contact. Multiple pieces of information can be associated with this contact."
    },
    {
      "index": 12,
      "name": "PAT_ENC_DATE_REAL",
      "type": "FLOAT",
      "discontinued": false,
      "description": "A unique, internal contact date in decimal format. The integer portion of the number indicates the date of the contact. The digits after the decimal distinguish different contacts on the same date and are unique for each contact on that date. For example, .00 is the first/only contact, .01 is the second contact, etc."
    },
    {
      "index": 17,
      "name": "PAT_ENC_CSN_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The unique contact serial number for this contact. This number is unique across all patient encounters in your system. If you use IntraConnect this is the Unique Contact Identifier (UCI)."
    },
    {
      "index": 22,
      "name": "DX_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The unique ID of the diagnosis record associated with the medication order."
    },
    {
      "index": 27,
      "name": "DX_QUALIFIER_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The category ID of the qualifier associated with the diagnosis.\n\n\nMay contain organization-specific values: Yes"
    },
    {
      "index": 33,
      "name": "DX_CHRONIC_YN",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Indicates whether the associated diagnosis is chronic.\n\n\nMay contain organization-specific values: No\n\n\n Category Entries: \n\n\nNo\n\n\nYes"
    },
    {
      "index": 42,
      "name": "COMMENTS",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Free text comments added when the prescription was ordered or discontinued."
    }
  ]
}
