{
  "table_name": "PAT_OCCUPN_HX",
  "description": "This table contains descriptive occupation history for patients recorded for a given encounter.  Each row represents one line of text for occupation description and/or occupation comments for a single employer.\n\n\nIf more than one occupation is commented on or described, each related line of descriptions/comments will have the employer ID field in that line populated with that occupation's employer ID.",
  "primary_key": {
    "column_name": "PAT_ENC_CSN_ID",
    "ordinal_position": "1"
  },
  "columns": [
    {
      "index": 2,
      "name": "PAT_ENC_CSN_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The unique system identifier of the patient encounter. Contact serial number is unique across all patients and all contacts."
    },
    {
      "index": 7,
      "name": "LINE",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The line number for the information associated with this record. Multiple pieces of information can be associated with this record."
    },
    {
      "index": 12,
      "name": "PAT_ENC_DATE_REAL",
      "type": "FLOAT",
      "discontinued": false,
      "description": "This is a numeric representation of the date of this encounter in your system. The integer portion of the number specifies the date of the encounter. The digits after the decimal point indicate multiple visits on one day."
    },
    {
      "index": 17,
      "name": "HX_EMPLOYER_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The unique system identifier of the patient's employer."
    },
    {
      "index": 22,
      "name": "HX_EMPLOYER_ID_EMPLOYER_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The name of the employer."
    },
    {
      "index": 27,
      "name": "HX_OCCUPN_COMMENT",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Any comments listed regarding the patient's occupation."
    },
    {
      "index": 32,
      "name": "HISTORY_SOURCE_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Stores the source of entry for this row of data (i.e. where this data came from). Some examples include:  Provider Patient Parent\n\n\nMay contain organization-specific values: Yes\n\n\n Category Entries: \n\n\nProvider\n\n\nPatient\n\n\nParent\n\n\nLegal Guardian\n\n\nProxy User"
    }
  ]
}
