{
  "table_name": "PRINT_REF_DOCS",
  "description": "The table stores information about reference documents that were printed from clinical references activity.",
  "primary_key": {
    "column_name": "PAT_ENC_CSN_ID",
    "ordinal_position": "1"
  },
  "columns": [
    {
      "index": 2,
      "name": "PAT_ENC_CSN_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The unique contact serial number for this contact. This number is unique across all patient encounters in your system. If you use IntraConnect, this is the Unique Contact Identifier (UCI)."
    },
    {
      "index": 7,
      "name": "LINE",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The line number for the information associated with this contact. Multiple pieces of information can be associated with this contact."
    },
    {
      "index": 12,
      "name": "CONTACT_DATE",
      "type": "DATETIME",
      "discontinued": false,
      "description": "The date of this contact in calendar format."
    },
    {
      "index": 17,
      "name": "CLIN_REF_DOCS",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Stores the unique identifiers for the Clinical References documents that are either added to patient instructions or printed from the document preview tab of Clinical References activity."
    },
    {
      "index": 22,
      "name": "REF_DOCS_ETX_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Stores the SmartText IDs of the Clinical References documents that are either added to patient instructions or printed from the document preview tab of the Clinical References activity."
    },
    {
      "index": 27,
      "name": "REF_DOCS_ETX_ID_SMARTTEXT_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The name of the SmartText record."
    },
    {
      "index": 32,
      "name": "REF_DOCS_ETX_DAT",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "This item stores the contact date (DAT) of the SmartText for the patient's Clinical Reference documents (I EPT 17282)."
    },
    {
      "index": 37,
      "name": "REF_DOC_SUGGES_DTTM",
      "type": "DATETIME (UTC)",
      "discontinued": false,
      "description": "Stores the instant when a suggested document was either added to Patient Instructions or was printed from the document preview tab of the Clinical References activity."
    },
    {
      "index": 42,
      "name": "REF_DOC_PRINT_DTTM",
      "type": "DATETIME (UTC)",
      "discontinued": false,
      "description": "This item stores the instant when a suggested document was printed either from Patient Instructions or from the document preview tab of the Clinical References activity."
    },
    {
      "index": 47,
      "name": "CLIN_REF_DOCS_TITLE",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Stores the display names for the Clinical References documents that are either added to patient instructions or printed from the document preview tab of Clinical References activity."
    },
    {
      "index": 52,
      "name": "REF_DOC_PRINT_USER_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Stores the user EMP ID who has printed the clinical reference document."
    }
  ]
}
