{
  "table_name": "REGADDL_ENC",
  "description": "The additional registration items are used to store organization specific patient data which is captured during Prelude or ADT workflows. The REGADDL_ENC table contains all of the encounter level items where a user may enter only a single value.",
  "primary_key": {
    "column_name": "PAT_ENC_CSN_ID",
    "ordinal_position": "1"
  },
  "columns": [
    {
      "index": 2,
      "name": "PAT_ENC_CSN_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The unique contact serial number for this contact. This number is unique across all patient encounters in your system. If you use IntraConnect, this is the Unique Contact Identifier (UCI)."
    },
    {
      "index": 7,
      "name": "PAT_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The unique ID of the patient record for this row. This column is frequently used to link to the PATIENT table."
    },
    {
      "index": 12,
      "name": "PAT_ENC_DATE_REAL",
      "type": "FLOAT",
      "discontinued": false,
      "description": "A unique contact date in decimal format. The integer portion of the number indicates the date of contact. The digits after the decimal distinguish different contacts on the same date and are unique for each contact on that date. For example, .00 is the first/only contact, .01 is the second contact, etc."
    },
    {
      "index": 17,
      "name": "REGADDL_ENC_1_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "First of eight additional registration encounter level category columns. The usage of this data element is defined by your organization.\n\n\nMay contain organization-specific values: Yes\n\n\n No Entries Defined"
    },
    {
      "index": 24,
      "name": "REGADDL_ENC_2_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Second of eight additional registration encounter level category columns. The usage of this data element is defined by your organization.\n\n\nMay contain organization-specific values: Yes\n\n\n No Entries Defined"
    },
    {
      "index": 31,
      "name": "REGADDL_ENC_3_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Third of eight additional registration encounter level category columns. The usage of this data element is defined by your organization.\n\n\nMay contain organization-specific values: Yes\n\n\n No Entries Defined"
    },
    {
      "index": 38,
      "name": "REGADDL_ENC_4_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Fourth of eight additional registration encounter level category columns. The usage of this data element is defined by your organization.\n\n\nMay contain organization-specific values: Yes\n\n\n No Entries Defined"
    },
    {
      "index": 45,
      "name": "REGADDL_ENC_5_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Fifth of eight additional registration encounter level category columns. The usage of this data element is defined by your organization.\n\n\nMay contain organization-specific values: Yes\n\n\n No Entries Defined"
    },
    {
      "index": 52,
      "name": "REGADDL_ENC_6_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Sixth of eight additional registration encounter level category columns. The usage of this data element is defined by your organization.\n\n\nMay contain organization-specific values: Yes\n\n\n No Entries Defined"
    },
    {
      "index": 59,
      "name": "REGADDL_ENC_7_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Seventh of eight additional registration encounter level category columns. The usage of this data element is defined by your organization.\n\n\nMay contain organization-specific values: Yes\n\n\n No Entries Defined"
    },
    {
      "index": 66,
      "name": "REGADDL_ENC_8_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Eighth of eight additional registration encounter level category columns. The usage of this data element is defined by your organization.\n\n\nMay contain organization-specific values: Yes\n\n\n No Entries Defined"
    },
    {
      "index": 73,
      "name": "REGADDL_ENC_1_DT",
      "type": "DATETIME",
      "discontinued": false,
      "description": "First of three additional registration encounter level date columns. The usage of this data element is defined by your organization."
    },
    {
      "index": 78,
      "name": "REGADDL_ENC_2_DT",
      "type": "DATETIME",
      "discontinued": false,
      "description": "Second of three additional registration encounter level date columns. The usage of this data element is defined by your organization."
    },
    {
      "index": 83,
      "name": "REGADDL_ENC_3_DT",
      "type": "DATETIME",
      "discontinued": false,
      "description": "Third of three additional registration encounter level date columns. The usage of this data element is defined by your organization."
    },
    {
      "index": 88,
      "name": "REGADDL_ENC_1_TM",
      "type": "DATETIME (Local)",
      "discontinued": false,
      "description": "First of three additional registration encounter level time columns. The usage of this data element is defined by your organization."
    },
    {
      "index": 93,
      "name": "REGADDL_ENC_2_TM",
      "type": "DATETIME (Local)",
      "discontinued": false,
      "description": "Second of three additional registration encounter level time columns. The usage of this data element is defined by your organization."
    },
    {
      "index": 98,
      "name": "REGADDL_ENC_3_TM",
      "type": "DATETIME (Local)",
      "discontinued": false,
      "description": "Third of three additional registration encounter level time columns. The usage of this data element is defined by your organization."
    },
    {
      "index": 103,
      "name": "REGADDL_ENC_1_NUM",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "First of three additional registration encounter level numeric columns. The usage of this data element is defined by your organization."
    },
    {
      "index": 108,
      "name": "REGADDL_ENC_2_NUM",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "Second of three additional registration encounter level numeric columns. The usage of this data element is defined by your organization."
    },
    {
      "index": 113,
      "name": "REGADDL_ENC_3_NUM",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "Third of three additional registration encounter level numeric columns. The usage of this data element is defined by your organization."
    },
    {
      "index": 118,
      "name": "REGADDL_ENC_1_STR",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "First of five additional registration encounter level string columns. The usage of this data element is defined by your organization."
    },
    {
      "index": 123,
      "name": "REGADDL_ENC_2_STR",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Second of five additional registration encounter level string columns. The usage of this data element is defined by your organization."
    },
    {
      "index": 128,
      "name": "REGADDL_ENC_3_STR",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Third of five additional registration encounter level string columns. The usage of this data element is defined by your organization."
    },
    {
      "index": 133,
      "name": "REGADDL_ENC_4_STR",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Fourth of five additional registration encounter level string columns. The usage of this data element is defined by your organization."
    },
    {
      "index": 138,
      "name": "REGADDL_ENC_5_STR",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Fifth of five additional registration encounter level string columns. The usage of this data element is defined by your organization."
    }
  ]
}
