{
  "table_name": "V_AP_CLAIM_CHANGE_HX_DTL",
  "description": "Contains detailed information about changes made to an AP claim.",
  "primary_key": {
    "column_name": "CLAIM_ID",
    "ordinal_position": "1"
  },
  "columns": [
    {
      "index": 2,
      "name": "CLAIM_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The unique identifier of the accounts payable claim record."
    },
    {
      "index": 7,
      "name": "LINE",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The line number for the information associated with this record. Multiple pieces of information can be associated with this record."
    },
    {
      "index": 12,
      "name": "ACTION_C_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The Change History Action category ID for the claim record. Indicates the item changed on the claim (i.e. workflow, workflow other status, etc.).\n\n\nMay contain organization-specific values: No\n\n\n Category Entries: \n\n\nCoverage Selection for Crossover\n\n\nDownstream Crossover Claim\n\n\nPossible Duplicate Warning\n\n\nClaim Restoration\n\n\nReferring Provider\n\n\nAttachment\n\n\nMC Claims Workflow\n\n\nProvider\n\n\nPlace of Service\n\n\nOperating Provider\n\n\nOther Provider\n\n\nAttending Provider\n\n\nRendering Provider\n\n\nSupervising Provider\n\n\nVendor\n\n\nCoverage Selection\n\n\nOwning Business Segment\n\n\nReferrals\n\n\nFrozen Status Change\n\n\nClaim Specialty\n\n\nStatus Change\n\n\nAP Status Change\n\n\nClaim EOB Code\n\n\nNetwork Override\n\n\nService Change\n\n\nWorkflow Other Status\n\n\nWorkflow Print Status\n\n\nIs Clinically Invalid Claim?\n\n\nOverride Is Clinically Invalid Claim?\n\n\nTrait 1 Evaluation\n\n\nTrait 2 Evaluation\n\n\nTrait 3 Evaluation\n\n\nTrait 4 Evaluation\n\n\nTrait 5 Evaluation\n\n\nUpstream Crossover Claim\n\n\nOriginal Claim for this Reversal Claim\n\n\nOriginal Claim for this Corrected Claim\n\n\nOriginal Claim for this Adjustment Claim\n\n\nThird-Party Pricer\n\n\nHeld for AP Reasons Change\n\n\nModifiers\n\n\nAssoc Diags\n\n\nService Line EOB Codes\n\n\nPOS Type\n\n\nRevenue Code\n\n\nDRG Code\n\n\nService Line Billed\n\n\nPayer Initiated Reduction\n\n\nPrimary Insurance Amount\n\n\nPrimary Patient Portion\n\n\nOverride Allowed Amount Reason\n\n\nOverride Disallowed Amount Reason\n\n\nNDC Code\n\n\nNDC Quantity\n\n\nNDC Units\n\n\nNDC Prescription Number\n\n\nNDC Link Sequence Number\n\n\nNDC Section 340B\n\n\nService Code\n\n\nQuantity\n\n\nService From Date\n\n\nService To Date\n\n\nType Of Service\n\n\nExternal System Action"
    },
    {
      "index": 83,
      "name": "PREV_VAL_RAW",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The value of the item before the change was made to the claim. IDs are not translated, so if Intraconnect is used, mapping to CIDs is necessary."
    },
    {
      "index": 88,
      "name": "NEW_VAL_RAW",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The value of the item after the change was made to the claim. IDs are not translated, so if Intraconnect is used, mapping to CIDs is necessary."
    },
    {
      "index": 93,
      "name": "PREV_CLAIM_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The claim ID stored in the the item before the change was made to the claim. This column only contains data for items that store claim IDs."
    },
    {
      "index": 98,
      "name": "NEW_CLAIM_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The claim ID stored in the the item after the change was made to the claim. This column only contains data for items that store claim IDs."
    },
    {
      "index": 103,
      "name": "PREV_PROV_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The provider ID stored in the the item before the change was made to the claim. This column only contains data for items that store provider IDs."
    },
    {
      "index": 108,
      "name": "NEW_PROV_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The provider ID stored in the the item after the change was made to the claim. This column only contains data for items that store provider IDs."
    },
    {
      "index": 113,
      "name": "PREV_POS_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The place of service ID stored in the item before the change was made to the claim. This column only contains data for items that store place of service IDs."
    },
    {
      "index": 118,
      "name": "NEW_POS_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The place of service ID stored in the item after the change was made to the claim. This column only contains data for items that store place of service IDs."
    },
    {
      "index": 123,
      "name": "PREV_VENDOR_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The vendor ID stored in the item before the change was made to the claim. This column only contains data for items that store vendor IDs."
    },
    {
      "index": 128,
      "name": "PREV_VENDOR_ID_VENDOR_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The name of the vendor."
    },
    {
      "index": 133,
      "name": "NEW_VENDOR_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The vendor ID stored in the item after the change was made to the claim. This column only contains data for items that store vendor IDs."
    },
    {
      "index": 138,
      "name": "NEW_VENDOR_ID_VENDOR_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The name of the vendor."
    },
    {
      "index": 143,
      "name": "PREV_COVERAGE_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The coverage ID stored in the item before the change was made to the claim. This column only contains data for items that store coverage IDs."
    },
    {
      "index": 148,
      "name": "NEW_COVERAGE_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The coverage ID stored in the item after the change was made to the claim. This column only contains data for items that store coverage IDs."
    },
    {
      "index": 153,
      "name": "PREV_REFERRAL_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The referral ID stored in the item before the change was made to the claim. This column only contains data for items that store referral IDs."
    },
    {
      "index": 158,
      "name": "NEW_REFERRAL_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The referral ID stored in the item after the change was made to the claim. This column only contains data for items that store referral IDs."
    },
    {
      "index": 163,
      "name": "PREV_RUL_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The third party pricing rule, entity or grouper ID stored in the item before the change was made to the claim. This column only contains data for items that store third party pricing rule, entity or grouper IDs."
    },
    {
      "index": 168,
      "name": "PREV_RUL_ID_RUL_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The name of the third-party pricing entity, grouper, or rule."
    },
    {
      "index": 173,
      "name": "NEW_RUL_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The third party pricing rule, entity or grouper ID stored in the item after the change was made to the claim. This column only contains data for items that store third party pricing rule, entity or grouper IDs."
    },
    {
      "index": 178,
      "name": "NEW_RUL_ID_RUL_NAME",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The name of the third-party pricing entity, grouper, or rule."
    },
    {
      "index": 183,
      "name": "PREV_FRZN_STATUS_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The category ID of the frozen status stored in the item before the change was made to the claim. This column only contains data for items that store frozen status category IDs."
    },
    {
      "index": 188,
      "name": "NEW_FRZN_STATUS_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The category ID of the frozen status stored in the item after the change was made to the claim. This column only contains data for items that store frozen status category IDs."
    },
    {
      "index": 193,
      "name": "PREV_CLM_STATUS_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The category ID of the claim status stored in the item before the change was made to the claim. This column only contains data for items that store claim status category IDs."
    },
    {
      "index": 198,
      "name": "NEW_CLM_STATUS_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The category ID of the claim status stored in the item after the change was made to the claim. This column only contains data for items that store claim status category IDs."
    },
    {
      "index": 203,
      "name": "PREV_AP_STATUS_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The category ID of the AP status stored in the item before the change was made to the claim. This column only contains data for items that store AP status category IDs."
    },
    {
      "index": 208,
      "name": "NEW_AP_STATUS_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The category ID of the AP status stored in the item after the change was made to the claim. This column only contains data for items that store AP status category IDs."
    },
    {
      "index": 213,
      "name": "PREV_WKFLW_OTHER_STATUS_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The category ID of the workflow other status stored in the item before the change was made to the claim. This column only contains data for items that store workflow other status category IDs."
    },
    {
      "index": 218,
      "name": "NEW_WKFLW_OTHER_STATUS_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The category ID of the workflow other status stored in the item after the change was made to the claim. This column only contains data for items that store workflow other status category IDs."
    },
    {
      "index": 223,
      "name": "PREV_WKFLW_PRINT_STATUS_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The category ID of the workflow print status stored in the item before the change was made to the claim. This column only contains data for items that store workflow print status category IDs."
    },
    {
      "index": 228,
      "name": "NEW_WKFLW_PRINT_STATUS_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The category ID of the workflow print status stored in the item after the change was made to the claim. This column only contains data for items that store workflow print status category IDs."
    },
    {
      "index": 233,
      "name": "PREV_CLAIM_TRAIT_1_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The category ID of the first claim trait stored in the item before the change was made to the claim. This column only contains data for items that store claim trait category IDs."
    },
    {
      "index": 238,
      "name": "NEW_CLAIM_TRAIT_1_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The category ID of the first claim trait stored in the item after the change was made to the claim. This column only contains data for items that store claim trait category IDs."
    },
    {
      "index": 243,
      "name": "PREV_CLAIM_TRAIT_2_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The category ID of the second claim trait stored in the item before the change was made to the claim. This column only contains data for items that store claim trait category IDs."
    },
    {
      "index": 248,
      "name": "NEW_CLAIM_TRAIT_2_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The category ID of the second claim trait stored in the item after the change was made to the claim. This column only contains data for items that store claim trait category IDs."
    },
    {
      "index": 253,
      "name": "PREV_CLAIM_TRAIT_3_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The category ID of the third claim trait stored in the item before the change was made to the claim. This column only contains data for items that store claim trait category IDs."
    },
    {
      "index": 258,
      "name": "NEW_CLAIM_TRAIT_3_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The category ID of the third claim trait stored in the item after the change was made to the claim. This column only contains data for items that store claim trait category IDs."
    },
    {
      "index": 263,
      "name": "PREV_CLAIM_TRAIT_4_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The category ID of the fourth claim trait stored in the item before the change was made to the claim. This column only contains data for items that store claim trait category IDs."
    },
    {
      "index": 268,
      "name": "NEW_CLAIM_TRAIT_4_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The category ID of the fourth claim trait stored in the item after the change was made to the claim. This column only contains data for items that store claim trait category IDs."
    },
    {
      "index": 273,
      "name": "PREV_CLAIM_TRAIT_5_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The category ID of the fifth claim trait stored in the item before the change was made to the claim. This column only contains data for items that store claim trait category IDs."
    },
    {
      "index": 278,
      "name": "NEW_CLAIM_TRAIT_5_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The category ID of the fifth claim trait stored in the item after the change was made to the claim. This column only contains data for items that store claim trait category IDs."
    },
    {
      "index": 283,
      "name": "PREV_HELD_FOR_AP_RSN_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The category ID of the held for AP reason stored in the item before the change was made to the claim. This column only contains data for items that store held for AP reason category IDs."
    },
    {
      "index": 288,
      "name": "NEW_HELD_FOR_AP_RSN_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The category ID of the held for AP reason stored in the item after the change was made to the claim. This column only contains data for items that store held for AP reason category IDs."
    },
    {
      "index": 293,
      "name": "PREV_POS_TYPE_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The category ID of the place of service type stored in the item before the change was made to the claim. This column only contains data for items that store place of service type category IDs."
    },
    {
      "index": 298,
      "name": "NEW_POS_TYPE_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The category ID of the place of service type stored in the item after the change was made to the claim. This column only contains data for items that store place of service type category IDs."
    },
    {
      "index": 303,
      "name": "PREV_CLAIM_SPEC_C",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The category ID of the claim specialty stored in the item before the change was made to the claim. This column only contains data for items that store claim specialty category IDs."
    },
    {
      "index": 308,
      "name": "NEW_CLAIM_SPEC_C",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The category ID of the claim specialty stored in the item after the change was made to the claim. This column only contains data for items that store claim specialty category IDs."
    },
    {
      "index": 313,
      "name": "PREV_OVRIDE_DISALW_AMT_RSN_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The category ID of the override disallow amount reason stored in the item before the change was made to the claim. This column only contains data for items that store override disallow amount reason category IDs."
    },
    {
      "index": 318,
      "name": "NEW_OVRIDE_DISALW_AMT_RSN_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The category ID of the override disallow amount reason stored in the item after the change was made to the claim. This column only contains data for items that store override disallow amount reason category IDs."
    },
    {
      "index": 323,
      "name": "PREV_OVRIDE_ALLOW_AMT_RSN_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The category ID of the override allow amount reason stored in the item before the change was made to the claim. This column only contains data for items that store override allow amount reason category IDs."
    },
    {
      "index": 328,
      "name": "NEW_OVRIDE_ALLOW_AMT_RSN_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The category ID of the override allow amount reason stored in the item after the change was made to the claim. This column only contains data for items that store override allow amount reason category IDs."
    },
    {
      "index": 333,
      "name": "PREV_TYPE_OF_SERVICE_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The category ID of the type of service stored in the item before the change was made to the claim. This column only contains data for items that store type of service category IDs."
    },
    {
      "index": 338,
      "name": "NEW_TYPE_OF_SERVICE_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The category ID of the type of service stored in the item after the change was made to the claim. This column only contains data for items that store type of service category IDs."
    },
    {
      "index": 343,
      "name": "PREV_WORKFLOW_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The category ID of the claim workflow stored in the item before the change was made to the claim. This column only contains data for items that store claim workflow category IDs."
    },
    {
      "index": 348,
      "name": "NEW_WORKFLOW_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The category ID of the claim workflow stored in the item after the change was made to the claim. This column only contains data for items that store claim workflow category IDs."
    },
    {
      "index": 353,
      "name": "PREV_VAL_YN",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The Yes/No value stored in the item before the change was made to the claim. This column only contains data for items that store Yes/No values."
    },
    {
      "index": 358,
      "name": "NEW_VAL_YN",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The Yes/No value stored in the item after the change was made to the claim. This column only contains data for items that store Yes/No values."
    },
    {
      "index": 363,
      "name": "PREV_NDC_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The NDC code ID stored in the item before the change was made to the claim. This column only contains data for items that store NDC code IDs."
    },
    {
      "index": 368,
      "name": "PREV_NDC_ID_NDC_CODE",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The external code for the National Drug Code (NDC). An NDC represents packages of medications."
    },
    {
      "index": 373,
      "name": "NEW_NDC_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The NDC code ID stored in the item after the change was made to the claim. This column only contains data for items that store NDC code IDs."
    },
    {
      "index": 378,
      "name": "NEW_NDC_ID_NDC_CODE",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The external code for the National Drug Code (NDC). An NDC represents packages of medications."
    },
    {
      "index": 383,
      "name": "PREV_NDC_UNITS_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The category ID of the NDC Units before the change was made to the claim. This column only contains data for items that store NDC Units category IDs."
    },
    {
      "index": 388,
      "name": "NEW_NDC_UNITS_C",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The category ID of the NDC Units after the change was made to the claim. This column only contains data for items that store NDC Units category IDs."
    }
  ]
}
