{
  "table_name": "V_EHI_AUDIT_HTT",
  "description": "This view contains one row for each audited item changed on a transaction record that corresponds to a column that is configured for EHI export.",
  "primary_key": {
    "column_name": "TX_ID",
    "ordinal_position": "1"
  },
  "columns": [
    {
      "index": 2,
      "name": "TX_ID",
      "type": "NUMERIC",
      "discontinued": false,
      "description": "The unique identifier for the transaction record."
    },
    {
      "index": 7,
      "name": "LINE",
      "type": "INTEGER",
      "discontinued": false,
      "description": "The line number for the information associated with this record. Multiple pieces of information can be associated with this record."
    },
    {
      "index": 12,
      "name": "CHANGE_USER_ID",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "This column stores the user who changed the items on the record."
    },
    {
      "index": 17,
      "name": "CHANGE_UTC_DTTM",
      "type": "DATETIME (UTC)",
      "discontinued": false,
      "description": "This column stores the date and time of data change on the record."
    },
    {
      "index": 22,
      "name": "TRANSACTION_LINE",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This column stores on which line the data change happened. It will be blank if the change is not specific to a line."
    },
    {
      "index": 27,
      "name": "ITEM_CHANGE_LN",
      "type": "INTEGER",
      "discontinued": false,
      "description": "This column stores on which item line the record's item changes. It is only set for multiple response item value changes."
    },
    {
      "index": 32,
      "name": "OLD_VALUE_INTERNAL",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Stores the old data value that was changed on the temporary transaction. If you use IntraConnect, this is the CID of the old stored value."
    },
    {
      "index": 37,
      "name": "OLD_VALUE_EXTERNAL",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "This column stores the previous value, in an external format, of the changed item in the record's audit history. This column shows the translated external value as of when the column was last extracted."
    },
    {
      "index": 42,
      "name": "NEW_VALUE_INTERNAL",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "Stores the new data value that was added to the temporary transaction. If you use IntraConnect, this is the CID of the new stored value."
    },
    {
      "index": 47,
      "name": "NEW_VALUE_EXTERNAL",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "This column stores the new value, in an external format, of the changed item in the record's audit history. This column shows the translated external value as of when the column was last extracted."
    },
    {
      "index": 52,
      "name": "CHANGED_DATA_ELEMENT",
      "type": "VARCHAR",
      "discontinued": false,
      "description": "The column descriptor that contains the metadata to be associated with data stored in columns OLD_VALUE_INTERNAL and NEW_VALUE_INTERNAL."
    }
  ]
}
